Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་། བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པ་དང་། འཁོར་གསུམ་ཡོངས་སུ་དག་པ་དང་། དུས་གསུམ་མཉམ་པ་ཉིད་དང་དྲི་མ་གསུམ་གྱི་དྲི་མ་སེལ་བ་དང་། ཁམས་གསུམ་པ་ལ་མི་རྟེན་པ་དང་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་འཇུག་པ་དང་། རིག་པ་གསུམ་གྱི་རིག་པ་ཤེས་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིན་ནོ།
en: Where there is no premeditation, no acceptance, no rejection, the purity of the three spheres, the equality of the three times, and the elimination of the three stains, where one does not depend on the three realms, enters the three gateways of liberation, and understands the three forms of knowing, these are veneration of the Thus-Gone One.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ན་བཟའ་དང་། བཤོས་དང་། གཟིམས་ཆ་དང་། གདན་དང་། སྙུན་གསོས་སྨན་དང་། ཡོ་བྱད་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བགྱིད་པ་གང་ལགས་པ་དེ་དག་ཀྱང་ཅི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བགྱིད་པ་ལགས་སམ།
en: Nāga King Sāgara said to the Blessed One, “Blessed One, does veneration of the Blessed One with flowers, perfumes, incense, flower garlands, lotions, powders, parasols, banners, pennants, clothing, food, bedding, seats, healing medicine, provisions, cymbals, and instruments also count as veneration of the Thus-Gone One?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་དེ་ནི་བླ་ན་མེད་པའི་མཆོད་པ་དེ་ཉིད་ཀྱིས་ཡོངས་སུ་སྦྱངས་པ་ཡིན་གྱིས།
en: The Blessed One answered, “Nāga Lord, through such unsurpassed veneration, one will be purified.

source: མཆོད་པ་དེ་ནི་ཤིན་ཏུ་མཐར་ཐུག་པ་དང་། ཤིན་ཏུ་དྲི་མ་མེད་པ་དང་། ཤིན་ཏུ་ཚངས་པར་སྤྱོད་པའི་མཐར་ཐུག་པ་ནི་མ་ཡིན་ནོ།
en: However, such veneration is not completely final, immaculate, or pure.

source: །ཀླུའི་བདག་པོ་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སློབ་པ་དེ་དག་ནི་འཕགས་པའི་རྣམ་པར་གྲོལ་བ་ལ། སེམས་གནས་ཀྱི་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་རྣམས་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: Still, Nāga Lord, such trainings in producing roots of virtue do lead to the liberation of the noble ones, which is better than not producing roots of virtue that are states of mind.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་ཆོས་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱེད་པ་དག་ཡིན་ཏེ།
en: Moreover, Nāga Lord, bodhisattvas possessing four qualities venerate the Thus-Gone One.

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པའི་བསོད་ནམས་ཀྱི་ཚོགས་སོགས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པའི་སེམས་ཀྱིས་ཡེ་ཤེས་ཀྱི་ཚོགས་སོགས་པ་དང་། བརྩོན་འགྲུས་ཆེན་པོ་ཤིན་ཏུ་བརྩམས་པའི་སེམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པ་དང་། ཆོས་ཟབ་མོ་རྒྱ་ཆེན་པོ་ལ་སེམས་བསྐྱེད་པས་བཟོད་པ་སྐྱེས་པ་ཐོབ་པ་སྟེ།
en: They are gathering the accumulation of merit through not forgetting the mind set on awakening, gathering the accumulation of wisdom through the mind practicing great compassion, purifying buddha realms through the mind that is engaged in extraordinary diligence, and arousing acceptance through arousing the mind set on the profound and vast Dharma.

source: ཀླུའི་བདག་པོ་ཆོས་འདི་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱེད་པ་ཡིན་ནོ།
en: Nāga Lord, bodhisattvas possessing these four qualities venerate the Thus-Gone One.”

source: །དེ་ནས་རྒྱལ་པོའི་ཁབ་ན་གནས་པའི་བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། ཁྱིམ་བདག་རྣམས་དང་། གྲོང་རྡལ་པ་དང་། ཡུལ་གྱི་མི་རྣམས་དང་། རྒྱལ་པོ་མ་སྐྱེས་དགྲ་དང་། བློན་པོ་དང་། ནང་འཁོར་དང་། སྒོ་དཔོན་དང་། འཁོར་དང་། ཚོང་དཔོན་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་གནས་སུ་བཤོས་གསོལ་ནས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་གཤེགས་སོ། །ཞེས་ཐོས་ནས་དེར་སྲོག་ཆགས་བདུན་ཁྲི་ཉིས་སྟོང་དང་། རྒྱལ་པོ་མ་སྐྱེས་དགྲ་གཡོག་འཁོར་སུམ་ཁྲི་ཉིས་སྟོང་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ནས་བྱུང་ནས། བྱ་རྒོད་ཕུང་པོའི་རི་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: When the priests, kṣatriyas, householders, village people, countrymen, and King Ajātaśatru and his ministers, inner retinue, gatekeepers, assembly, and merchants heard that the Blessed One had taken food in Nāga King Sāgara’s realm and returned to Vulture Peak Mountain, they came out from the city of Rājagṛha with seventy-two thousand beings, in addition to King Ajātaśatru’s retinue of thirty-two thousand, and proceeded to Vulture Peak Mountain.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: As they arrived, they bowed their heads to the Blessed One’s feet, circumambulated him three times, and sat to one side.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་ཆེན་པོར་གཤེགས་ན་ཆབ་ཀྱི་ཚོགས་དེ་ན་མཆིས་པ་དེ་གང་དུ་མཆི་ལགས།
en: King Ajātaśatru then asked the Blessed One, “Blessed One, when the Thus-Gone One went into the ocean, what happened to the great mass of water that is normally there?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་གང་གི་ཚེ་དགེ་སློང་མེའི་ཁམས་ཀྱི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པ་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་མེས་ཡོངས་སུ་གང་བར་མཐོང་ན།
en: The Blessed One answered, “Great king, when a monk enters the absorption of the fire element , he sees all the worlds of the great trichiliocosm filled with fire.

source: དེའི་ཆུའི་ཕུང་པོ་དེ་དག་གང་དུ་སོང་། གསོལ་པ།
en: At that point, where has all the water gone?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་ཏིང་ངེ་འཛིན་ལ་དབང་ཐོབ་པའི་སེམས་དེ་ལྟ་བུར་ལས་སུ་རུང་བར་གྱུར་པ་ལགས་སོ།
en: “Blessed One, the mind of one who has achieved the power of meditative absorption has this kind of capability.”

source: །བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་དེ་ཉན་ཐོས་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ལ་དབང་ཐོབ་པའི་སེམས་ལས་སུ་རུང་བ་ལས་གྱུར་པར་འདོད་ན་དེ་བཞིན་གཤེགས་པ་རྟག་ཏུ་མཉམ་པར་བཞག་པ། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་མཁས་པ། སེམས་ལ་དབང་ཡོད་པ། ཆོས་ཐམས་ཅད་ཀྱི་དབང་ཕྱུག །ཆོས་རྣམས་ལ་དབང་ཡོད་པ་ནི་དེ་ལྟར་མི་འདོད་དམ།
en: “Great king, if you accept that the mind of a hearer who has achieved the power of absorption and attainment is capable, do you not accept that a thus-gone one, who is always in a state of equipoise, who is skilled in all absorptions and attainments, who has power over the mind, who is the master of all phenomena, and who has power over phenomena, is also capable of the same?

source: རྒྱལ་པོ་ཆེན་པོ་གང་གི་ཚེ་ང་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་པ་དེའི་ཚེ་ཆུ་དེའི་ནང་ན་གནས་པའི་སེམས་ཅན་རྣམས་ནི་བདག་ཉིད་ཆུའི་ནང་ན་གནས་སོ་སྙམ་དུ་འཛིན་ཏོ།
en: Great king, when I entered the ocean, the beings residing there perceived that I was in the water.

source: །སྐམ་ས་ལ་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱིས་ནི་རྒྱ་མཚོ་ཆེན་པོ་བསྐམས་པར་མཐོང་ངོ་།
en: However, beings living on dry land perceived that the ocean had evaporated.

source: །ཇི་ལྟར་གཞན་འཕྲུལ་དབང་བྱེད་པའི་ལྷ་རྣམས་ཀྱི་གནས་ཀྱི་བཀོད་པ་རྣམས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་དེ་བཞིན་དུ་ཀླུ་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་གྱི་གནས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱིས་ཁྱབ་པར་གྱུར་ཏོ།
en: The light of the Thus-Gone One pervades all the realms of nāgas, gandharvas, and asuras, just as the arrays in the Heaven of Making Use of Others’ Emanations are adorned with every kind of ornament.

source: །རྒྱ་མཚོ་ཆེན་པོའི་ནང་གི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་གཅིག་ལ་གཅིག་བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་དང་གནོད་སེམས་མེད་པ་དང་། རྣམ་པར་འཚེ་བ་མེད་པར་གནས་པར་གྱུར་ཏོ།
en: The beings in the ocean were even loving toward one another, had altruistic minds, and were without the minds of malice and harm.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཆེ་བ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་ལ་མཁས་པ་དེ་ཙམ་དུ་བསམ་གྱིས་མི་ཁྱབ་པ་ནི་ངོ་མཚར་ལགས་ཏེ།
en: King Ajātaśatru then remarked to the Blessed One, “Blessed One, how amazing that the eminence of the blessed buddhas’ awakening and the bodhisattvas’ skill in means is so inconceivable and incredible!

source: འདི་ལྟར་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་དེ་བཞིན་གཤེགས་པ་སྤྱན་དྲངས་ཏེ། དེ་ལྟར་སེམས་ཅན་གྱི་དོན་ཚད་མ་མཆིས་པ་བགྱིས་ན།
en: In this way Nāga King Sāgara could invite the Thus-Gone One in, and so doing accomplish an immeasurable benefit for beings.

source: བཅོམ་ལྡན་འདས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཡུན་ཇི་སྲིད་ཅིག་ནས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ལགས།
en: How long ago, Blessed One, did Nāga King Sāgara develop the mind set on unsurpassed and perfect awakening?

source: དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་ལ་ནི་མཆོད་པ་བགྱིས། ཡུན་ཇི་སྲིད་ཅིག་ན་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ལགས།
en: Having venerated the Thus-Gone One to this extent, how long will it take for him to fully awaken to unsurpassed and perfect buddhahood?

source: དེ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་མཚན་ནི་ཅི་ཞེས་བགྱི་བར་འགྱུར།
en: What will the name of this perfect buddha be?

source: དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་ཅི་འདྲ་བར་འགྱུར་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: What will his buddha realm be like?”

source: རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ། ཡུན་རིང་བ། ཚད་མེད་པའི་སྔ་རོལ་དེའི་ཚེ་དེའི་དུས་ན་བསྐལ་པ་ཡིད་དུ་འོང་ཞིང་ཞི་བ་ཞེས་བྱ་བ་ལ་ཤར་གྱི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བ་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་རྣམ་པར་དག་པའི་འོད་ཟེར་རྒྱལ་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། རྒྱལ་པོ་ཆེན་པོ་འཇིག་རྟེན་གྱི་ཁམས་ལྟ་བ་ཡོངས་སུ་དག་པ་དེའི་བཀོད་པ་བྱུང་བ་དེ་དག་ནི་ངའི་ཚེའི་ཚད་བསྐལ་པར་གནས་སུ་ཟིན་ཀྱང་རྒྱས་པར་བསྟན་པར་ནུས་པར་སླ་བ་མ་ཡིན་ནོ།
en: The Blessed One answered, “Great king, even longer than countless eons ago, an unfathomably and immeasurably long time ago, in the eon called Pleasant and Peaceful, a thus-gone one, a worthy one, a perfect buddha, someone learned and virtuous, a well-gone one, a knower of the world, a charioteer who guides beings, an unsurpassed being, a teacher of gods and humans named Radiant King of Pure Light, appeared in a world to the east called Pure View. Great king, it would be difficult for me to conclusively describe the layout of this world Pure View, even if my lifespan were to last for an eon.

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལྷས་བཙའ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: Great king, at that time there was a universal monarch named Divine Birth

source: དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་རྣམ་པར་དག་པའི་འོད་ཟེར་རྒྱལ་པོ་དེ་ལ་ལོ་བཞི་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་མཆོད་པ་བྱས་ཏེ།
en: He venerated the Blessed Thus-Gone One Radiant King of Pure Light for forty-two thousand years, relying on the roots of virtue.

source: དགེ་བའི་རྩ་བས་ཉེ་བར་བརྟན་པ་དེ་གཉིད་ལོག་པའི་རྨི་ལམ་དུ་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་ཐོས་སོ།
en: Once, in a dream as he was sleeping, he heard the following pair of verses:

source: །སྐྱེས་བུ་ཁྱུ་མཆོག་ལ་ནི་མཆོད་ཆེན་མངའ།
en: ‘You have mastered the veneration of supreme beings

source: །དཔག་མེད་རྒྱ་ཆེན་བསམ་ཡས་བྱས་ཟིན་གྱིས།
en: In a way that is immeasurable, vast, and inconceivable.

source: །འགྲོ་བ་དག་ལ་སྙིང་བརྩེ་བསྐྱེད་ནས་ཀྱང་།
en: As a pure being, though you have aroused loving compassion,

source: །རབ་མཆོག་བྱང་ཆུབ་སེམས་ནི་བསྐྱེད་པར་གྱིས།
en: You still must develop the supreme mind set on awakening.

source: །བྱང་ཆུབ་སེམས་ནི་ཡང་དག་སྒྲུབ་བྱེད་གང་།
en: ‘Those who genuinely accomplish the mind set on awakening

source: །དེ་ནི་མཆོད་མཆོག་དམ་པ་ཁྱད་པར་འཕགས།
en: Becomes sublime, ennobled, and widely venerated.

source: །དེ་ནི་དེ་བཞིན་གཤེགས་རྣམས་བཀུར་སྟི་ཡིན།
en: They become servants of the thus-gone ones,

source: །དེ་ནི་ཕྱི་མའི་བསོད་ནམས་གཟི་བྱིན་ཡིན།། །།བམ་པོ་བདུན་པ་སྟེ་ཐ་མ།
en: And their merit to come will be glorious.’

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལྷས་བཙའ་དེས་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་ཐོས་ཏེ། དེའི་མཚན་མོ་འདས་ནས་གཡོག་འཁོར་དང་བཅས་ཏེ།
en: “Great king, once the night in which the universal monarch Divine Birth heard these two verses was over, he went with his servants to meet the Blessed Thus-Gone One Radiant King of Pure Light.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་རྣམ་པར་དག་པའི་འོད་ཟེར་རྒྱལ་པོ་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེའི་སྤྱན་སྔར་འཁོད་དེ།
en: Arriving in his presence, they bowed their heads to the Blessed One’s feet, circumambulated him three times, and sat down before the Blessed One together with eighty-four thousand beings.

source: ཐལ་མོ་སྦྱར་ནས་ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Joining their palms, they formed the intention to develop the mind set on unsurpassed and perfect awakening.

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: At that time, the universal monarch spoke the following verses: “ ‘One cannot realize the supreme awakening

source: །གཟུགས་ལ་བརྐམ་དང་སྒྲ་ལ་རྟེན་པ་དང་། །དྲི་དང་རོ་དང་རེག་ལ་གནས་པ་དང་། །འདོད་ལ་བརྐམ་དང་བདེ་བ་དགའ་བ་ཡིས། །བྱང་ཆུབ་མཆོག་འདི་རྟོགས་པར་མི་ནུས་སོ།
en: While craving form, depending on sound, Dwelling on smell, taste, and tactile sensation, Craving the desired, and enjoying pleasures. “ ‘One who is lazy, devoted to sordidness, Stingy, unbound by discipline,

source: །ལེ་ལོ་ཅན་དང་དམའ་ལ་བརྩོན་པ་དང་། །སེར་སྣ་ཅན་དང་ཚུལ་ཁྲིམས་མ་བསྡམས་དང་། །སྡང་བའི་སེམས་དང་བློ་ནི་འཁྲུལ་པ་ཡིས།
en: Aggressive, or deluded

source: །བྱང་ཆུབ་མཆོག་འདི་རྟོགས་པར་མི་ནུས་སོ།
en: Cannot realize supreme awakening. “ ‘One who abandons all pursuit of pleasure,

source: །རང་གི་བདེ་བ་ཐམས་ཅད་སྤངས་པ་དང་། །འགྲོ་བའི་སྡུག་བསྔལ་ཐམས་ཅད་བཟོད་པ་དང་། །བརྩོན་འགྲུས་བརྩམས་ཤིང་རྟག་ཏུ་ཆོས་འདོད་གང་།
en: Is patient with all suffering beings, Sets forth with diligence, and is always passionate for the Dharma

source: །དེ་ནི་འཇིག་རྟེན་དེ་འདྲའི་སངས་རྒྱས་འགྱུར།
en: Will become a buddha for the world.

source: །སངས་རྒྱས་བྱང་ཆུབ་ལ་ནི་བདག་ཞུགས་པ།
en: ‘I have set forth toward buddhahood,

source: །སངས་རྒྱས་རྣམས་དང་ལྷ་རྣམས་དཔང་བཙུགས་ཏེ།
en: Taking the buddhas and gods as my witnesses.

source: །ཅི་ནས་བདག་ཚིག་ལོག་པར་མི་འགྱུར་བ།
en: By all means, may my words not go astray,

source: །དེ་ལྟར་སྨན་སླད་སྤྱོད་པ་སྤྱད་པར་བགྱི།
en: And may I act in a way that is beneficial.

source: །བྱང་ཆུབ་སེམས་ནི་བདག་གིས་རྨི་ལམ་ཐོས།
en: ‘I heard about the mind set on awakening in a dream,

source: །ཐོས་ནས་བདག་ནི་བྱང་ཆུབ་མཆོག་ལ་ཞུགས།
en: And upon hearing this, I set forth toward supreme awakening.

source: །དེ་ཡི་སླད་དུ་སངས་རྒྱས་མི་ཡི་མཆོག །ཡེ་ཤེས་ལྡན་པ་དེ་འདྲ་བདག་གིས་བགྱི།
en: For this reason, I will become Like the Buddha, the greatest of humans—the wise one.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལྷས་བཙའ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་དུ་ཁྱོད་སོམ་ཉིའམ། ཡིད་གཉིས་སམ། ཐེ་ཚོམ་ཟ་ན་རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ།
en: “Great king, if you are wondering, equivocating, or doubting whether he who at that time was the universal monarch Divine Birth was someone else, do not do so.

source: ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་འདི་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ལྷས་བཙའ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Because at that time Nāga King Sāgara was the universal monarch Divine Birth

source: །དེ་ཡང་དེའི་དང་པོ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཡིན་ནོ།
en: Furthermore, that was the first time he developed the mind set on awakening.

source: །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་འདི་སྐད་དུ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་འདི་ཡུན་ཇི་སྲིད་ཅིག་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞེས་ཟེར་བ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་འདི་ནི་བསྐལ་པ་གྲངས་མེད་པ་ཉིས་བརྒྱན་བསྐལ་པ་དཔལ་གྱི་མེ་ཏོག་ཅེས་བྱ་བ་ལ། འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་སྒྲ་གྲག་པ་ཞེས་བྱ་བར། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ།
en: “Great king, you asked, ‘How long will it take for Nāga King Sāgara to fully awaken to unsurpassed and perfect buddhahood?’ Listen to me, great king:

source: སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤིན་ཏུ་དྲི་མ་མེད་ཅིང་ཡོངས་སུ་དག་ལ་ཡོན་ཏན་གྱི་ཚོགས་མཐའ་ཡས་པ་ལས་བྱུང་བའི་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་རོ། །རྒྱལ་པོ་ཆེན་པོ་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་སྒྲ་གྲག་པ་དེ་ནི་རིན་པོ་ཆེ་ས་ཡས་སྤྲས་པར་འགྱུར་ཏེ།
en: in two hundred countless eons, in the eon called Glory of Flowers, Nāga King Sāgara will, in a world called Sound of Dharma , become a blessed one, a thus-gone one, a worthy one, a perfect buddha, someone learned and virtuous, a well-gone one, a knower of the world, a charioteer who guides beings, an unsurpassed being, and a teacher of gods and humans, a blessed buddha called Pure and Immaculate King Who Arises from an Infinite Assembly of Qualities.

source: འཛམ་བུ་ཆུ་བོའི་གསེར་ལས་གྲུབ་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་དུ་མས་བྲིས་ཤིང་མིག་མངས་རིས་སུ་རྣམ་པར་ཕྱེ་ལ། ལག་མཐིལ་བཞིན་དུ་མཉམ་སྟེ། ཀ་ཙ་ལིན་དི་ཀའི་གོས་བཞིན་དུ་འཇམ་ཞིང་རེག་ན་བདེ་ལ་ཡངས་ཤིང་ཐ་གྲུ་ཆེ་སྟེ། གླིང་བྱེ་བ་ཕྲག་འབུམ་དང་ལྡན་ལ། འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ཡིད་དུ་འོང་བ་སྟེ།
en: “Great king, the world Sound of Dharma will be adorned with millions of precious materials, marked with gold of the Jambū river and various jewels, divided like a checkerboard, flat like the palm of one’s hand, soft and pleasing to the touch like the plumage of the kācilindi bird, vast and open, replete with millions of continents, prosperous, rich, happy, pleasant, and filled with gods and humans.

source: ལྷ་དང་མི་མང་པོ་དག་གིས་གང་ལ། གཞན་འཕྲུལ་དབང་བྱེད་པའི་ལྷ་རྣམས་ཀྱི་ཉེ་བར་སྤྱད་པ་དང་ལོངས་སྤྱོད་ཇི་ལྟ་བ་བཞིན་དུ་མི་དེ་དག་གི་ཡང་དེ་དང་འདྲ་བར་འགྱུར་རོ།
en: The people there will have enjoyments and riches like the gods of the Heaven of Making Use of Others’ Emanations.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་སྒྲ་གྲག་པ་ཞེས་བྱ་བ་དེ་ན་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་གྲུབ་པའི་ཤིང་ཏ་ལའི་ཕྲེང་བ་དག་འབྱུང་བར་འགྱུར་ཏེ།
en: In the world Sound of Dharma will stand rows of palm trees made entirely of jewels.

source: ཤིང་ཏ་ལ་དེ་དག་གི་ལོ་མ་དང་མེ་ཏོག་དང་འབྲས་བུ་ཐམས་ཅད་ལས་ཆོས་ཀྱི་སྒོ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་མང་པོ་དག་འབྱུང་ངོ་། །འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་སྒྲ་ཇི་སྙེད་འབྱུང་བ་འདི་ལྟ་སྟེ། ལྷའི་སྒྲའམ།
en: From the leaves, flowers, and fruits of these palm trees will emanate billions of Dharma sounds. The sounds that resound throughout that world will be as follows:

source: མིའི་སྒྲའམ། མི་མ་ཡིན་པའི་སྒྲའམ། སྤྲུལ་པའི་སྒྲའམ། བྱའི་སྒྲའམ། རླུང་གི་སྒྲ་ཡང་རུང་སྟེ།
en: the sounds of the gods, of humans, of nonhumans, of emanations, of birds, and even of the wind.

source: སྒྲ་དེ་དག་ཐམས་ཅད་ཆོས་དང་ལྡན་པར་འབྱུང་བར་འགྱུར་རོ།
en: All such sounds will communicate the Dharma.

source: །དེ་བཞིན་དུ་ཞི་བ་དང་ལྡན་པ་དང་། རབ་ཏུ་ཞི་བ་དང་ལྡན་པ་དང་། ཉེ་བར་ཞི་བ་དང་ལྡན་པ་དང་། དགའ་བ་དང་དབེན་པ་དང་ལྡན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་དང་ལྡན་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པ་དང་། བསྡུ་བའི་དངོས་པོ་དང་ལྡན་པ་དང་། ཐབས་ལ་མཁས་པ་དང་ལྡན་པ་དང་། སྐྱོ་བ་དང་། འདོད་ཆགས་དང་བྲལ་བའི་ལྟ་བ་དང་ལྡན་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་ལྡན་པའི་སྒྲ་དག་འབྱུང་བར་འགྱུར་ཏེ།
en: Likewise, such sounds will communicate peace, utter peace, absolute peace, disengagement from pleasure, the qualities of buddhahood, the perfections, the means of attracting disciples, skill in means, disenchantment, the view that is free from attachment, emptiness, the absence of marks, the absence of wishes, and the unconditioned.

source: དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེའི་མིང་ཆོས་ཀྱི་སྒྲ་གྲག་པ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: This is why this world is called Sound of Dharma

source: །འཇིག་རྟེན་གྱི་ཁམས་དེར་ལྷ་དང་མི་གང་དག་སྐྱེ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཆོས་ཀྱི་དགའ་བའི་ཟས་ཁོ་ན་དང་ལྡན་པར་འགྱུར་ཞིང་མངོན་པར་ཤེས་པའི་ཤེས་པ་ལ་མཁས་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཐེ་ཚོམ་མེད་པ་ཤ་སྟག་གོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་དྲི་མ་མེད་ཅིང་ཡོངས་སུ་དག་ལ།
en: Any god or human born in that world will only partake of the food that delights the Dharma, will be skilled in the higher knowledges, and will have no doubt about unsurpassed and perfect awakening.

source: ཡོན་ཏན་གྱི་ཚོགས་མཐའ་ཡས་པ་ལས་བྱུང་བའི་རྒྱལ་པོ་དེ་ཡང་གང་གི་ཚེ་ཆོས་སྟོན་པར་བཞེད་པ་དེའི་ཚེ། དེ་ཉིད་ཀྱི་སྐུ་ལས་འོད་འགྱེད་པར་མཛད་དེ། འོད་དེས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྣང་བར་འགྱུར་རོ།
en: “When the Blessed Thus-Gone One Pure and Immaculate King Who Arises from an Infinite Assembly of Qualities agrees to teach the Dharma, light will shoot from his body and illuminate all buddha realms.

source: །དེ་བཞིན་གཤེགས་པའི་འོད་དེ་ལས་ཀྱང་སངས་རྒྱས་བྱེ་བ་ཕྲག་སྟོང་གསུང་བའི་ཆོས་སྟོན་པ་འབྱུང་བར་འགྱུར་རོ།
en: That light will also be the source of the Dharma teachings of ten billion buddhas.

source: །དེ་ན་ལྷ་དང་མི་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་འོད་དེ་ཡང་མཐོང་ལ་ཆོས་བསྟན་པ་དེ་ཡང་ཐོས་ནས་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་ཆེན་པོ་རྒྱ་ཆེར་སྐྱེས་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་དྲི་མ་མེད་ཅིང་ཡོངས་སུ་དག་ལ།
en: The humans and gods there will find joy and vast supreme ecstasy as they perceive the Thus-Gone One’s light and hear his Dharma teaching.

source: ཡོན་ཏན་གྱི་ཚོགས་མཐའ་ཡས་པ་ལས་བྱུང་བའི་རྒྱལ་པོ་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པ་ཚད་མེད་པ་བྱས་ཏེ།
en: They will come before the Blessed Thus-Gone One Pure and Immaculate King Who Arises from an Infinite Assembly of Qualities and make immeasurable supplications to the Thus-Gone One.

source: རྫུ་འཕྲུལ་དང་མངོན་པར་ཤེས་པའི་སྟོབས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ན་རིན་པོ་ཆེའི་བཀོད་པ་ཆེན་པོ་དང་ལྡན་པའི་པད་མ་དག་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་པར་འགྱུར་རོ།
en: Through their miraculous power and higher knowledges, they will be seated cross-legged in the middle of the sky on lotus flowers studded with many gems.

source: །དེ་བཞིན་གཤེགས་པ་དེ་ཡང་ནམ་མཁའི་དཀྱིལ་ཉིད་ན་སེང་གེའི་ཁྲི་ལ་བཞུགས་ཏེ་ལྷ་དང་མི་དེ་དག་ལ་ཆོས་སྟོན་ཏོ།
en: The Thus-Gone One will also sit upon a lion throne in the midst of space and teach the Dharma to the gods and humans.

source: །དེ་ཆོས་སྟོན་པ་ན་ཕྱོགས་བཅུ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཚད་མེད་གྲངས་མེད་པ་བརྒྱ་སྟོང་དག་ཆོས་མཉན་པའི་ཕྱིར་འོང་བར་འགྱུར་རོ།
en: When he teaches the Dharma, many countless and immeasurable thousands of bodhisattvas will come to listen.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་སེམས་ཅན་སུ་ཡང་ཆོས་ལ་ཞེ་འགྲས་པ་མེད་དོ།
en: Nobody in that world will be hostile to the Dharma.

source: །དེ་ན་བདུད་སྡིག་ཅན་དག་དང་གཞན་མུ་སྟེགས་ཅན་དག་གི་སྒྲར་གདགས་པ་ཡང་མེད་དོ།
en: There will not even be anyone to whom the monikers evil māra or non-Buddhist can be applied.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་ཚེའི་ཚད་ནི་བསྐལ་པ་བཅུར་འགྱུར་རོ།
en: The lifespan of this thus-gone one will be ten eons.

source: །དེའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བགྲང་བ་ལས་འདས་པར་འགྱུར་རོ།
en: His bodhisattvas will be innumerable.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟར་ན་སངས་རྒྱས་ཀྱི་ཞིང་དེའི་བཀོད་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: In this manner, great king, the displays of that buddha realm will be unfathomable.

source: །ཆོས་བསྟན་པ་ཡང་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: The Dharma teachings will also be unfathomable.

source: །ཞབས་འབྲིང་བ་འཁོར་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: His assembly of servants and bodhisattvas will also be unfathomable.

source: །ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལུང་བསྟན་པའི་ལེའུ་སྟེ་བརྒྱད་པའོ།།
en: Chapter Eight: Nāga King Sāgara’s Prophecy

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་རྒྱུའི་རྗེས་སུ་འབྲང་བ་དང་། རྣམ་པར་བསྒྲུབས་ན་འབྱུང་བའི་མཚན་ཉིད་ལགས་ཏེ།
en: King Ajātaśatru then remarked to the Blessed One, “Blessed One, all phenomena accord with their causes. When they are produced, they have the characteristic of arising.

source: དེ་དག་ནི་ཇི་ལྟ་ཇི་ལྟར་འདོད་པ་དེ་ལྟ་དེ་ལྟར་རྣམ་པར་འགྲུབ་པ་ལགས་སོ།
en: They come into being just as they are desired.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་ནི་མཐའ་ཡས་པ་ལགས་སོ།
en: Blessed One, the conduct of awakening is infinite.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཇི་སྲིད་དུ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་མ་བཟུང་བ་དེ་སྲིད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: In this regard, for as long as bodhisattvas have not taken hold of a buddha realm replete with all supreme aspects, they will engage in bodhisattva conduct.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ནི་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱང་བར་བགྱིའོ།
en: Blessed One, all bodhisattvas will purify buddha realms just like Nāga King Sāgara.”
